{"id":176590,"xmlId":"app.pieces.plugins.jetbrains","name":"Pieces","description":"<h2>The fastest, smartest AI Assistant for code snippets</h2>\n\n<p>Automatically or manually save code from anywhere, then power up with code auto-completion from your own snippets. 100% free!</p>\n\n<h2>Instantly save snippets from JetBrains or your browser</h2>\n\n<ul><li>Highlight code in JetBrains and simply right-click or use a keyboard shortcut to save snippets</li><li>One-click save snippets from any webpage with Pieces browser plugins</li></ul>\n\n<h2>Auto-save useful snippets</h2>\n\n<ul><li>The Pieces AI Assistant suggests auto-completions as you type</li><li>Suggestions are trained on your personal repo of saved snippets.  Pieces code completions are complimentary to open source-centric auto-completion tools!</li><li>Suggestions can be based on the snippet name, code contents or any metadata such as a tag</li><li>No size limit for auto-completions -  auto-complete from a single line or a 1000-line widget tree</li></ul>\n\n<h2>Saved snippets are intelligently enriched</h2>\n\n<ul><li>Auto-classifies your snippet by language</li><li>Auto-generates tags based on the content or structure of the snippet, where it was saved from and more. So you can quickly find that one snippet later</li></ul>\n\n<h2>Manage snippets inside JetBrains</h2>\n<ul><li>View and insert saved snippets from the Pieces list in JetBrains</li></ul>\n\n<h2>Unlock more features with the Pieces desktop app</h2>\n\n<ul><li>The Pieces desktop app enables additional features such as:</li><li>Responsive UI to view snippets in ultra-narrow or wide screens</li><li>Save screenshots of code to Pieces, instantly receive the copyable snippet.  Death to manually retyping!</li><li>(Coming soon) Share snippets via shareable links.  Shared links include the snippet, tags and more meta-data</li><li>And much more!</li></ul>\n\n<h2>Safe &amp; Secure</h2>\n\n<ul><li>Runs 100% locally on your machine with the option to connect to the Cloud for backup, sync and sharing</li></ul>\n\n<h2>Installation</h2>\n\n<p>To get started it is <strong>required</strong> to download Pieces from <a href=\"https://pieces.app/install\">pieces.app/install</a>.   This enables Pieces to run locally on your machine and manages connections to Pieces plugins. This plugin will not run without Pieces installed.</p>","tags":["User Interface","Code Tools","Fun Stuff","Tools Integration","Code Editing","OS Integration","Cloud"],"vendor":"Mesh Intelligent Technologies Inc.","version":"3.4.2","notes":"<h3>Added</h3>\n<ul><li>Option to disable autocomplete feature</li><li>Enabled analytics for better and faster error resolution</li><li>Enabled saving a file from project file tree to pieces</li></ul>\n\n<h3>Changed</h3>\n<ul><li>Insertable snippet list can now be filtered to match the editor's context</li></ul>","dependencies":["com.intellij.modules.platform"],"since":"211.0","until":"221.*","size":8797351}