{"id":183808,"xmlId":"org.zowe.explorer","name":"Zowe Explorer","description":"Smart and Interactive Mainframe code editing tool that brings support for browsing, editing and creating data on z/OS via <a href=\"https://www.ibm.com/docs/en/zos/2.4.0?topic=guide-using-zosmf-rest-services\">z/OSMF REST API</a>.<br>\nIBA Group team of <b>mainframe enthusiasts</b> are actively developing new features for the open-source \"Zowe Explorer\" plugin.\nWe keep improving existing features that help you to:<br>\n<ul>\n  <li>Start working with z/OS easily with no complex configurations.</li>\n  <li>Organize datasets on z/OS, files on USS into Working Sets.</li>\n  <li>Allocate datasets, create members, files and directories with different permissions.</li>\n  <li>Perform renaming, copying and moving data in a modern way.</li>\n  <li>Edit datasets, files and members. Smart auto-save will keep your content both in the editor and on the mainframe in-sync.</li>\n  <li>Create multiple connections to different z/OS systems.</li>\n  <li>Perform all available operations with Jobs.</li>\n  <li>Highlight all IntelliJ supported languages automatically and recognize them once opened from the mainframe.</li>\n</ul><br>\nTo start using the plugin:<br>\n<ul>\n  <li>Install the plugin in your Intellij based IDE.</li>\n  <li>Contact your RACF administrator so that your user is in the <a href=\"https://www.ibm.com/docs/en/zos/2.4.0?topic=guide-security-structures-zosmf\">IZUUSER  RACF group</a></li>\n  <li>You are ready to go! Start working with z/OS from the IDE.</li>\n</ul><br>\n<b>Note: z/OS 2.1 or higher is required with <a href=\"https://docs.zowe.org/stable/user-guide/systemrequirements-zosmf.html\">configured z/OSMF</a>. Plugin is in active development state.<br>\nFeel free to recommend or report everything on our <a href=\"https://github.com/zowe/zowe-explorer-intellij/issues\">Github</a></b><br>\nJoin us in <a href=\"https://openmainframeproject.slack.com/archives/C020BGPSU0M\">Slack</a><br>","organization":"Zowe","tags":["OS Integration","Remote APIs","Administration Tools"],"vendor":"Zowe","version":"0.2.0","notes":"<b>New features:</b>\n      <ul>\n        <li>Added ability to copy from remote host to a local machine</li>\n        <li>Added Job Console log view. Actions on Jobs are being developed</li>\n        <li>Some major fixes and minor features. See in detailed report</li>\n      </ul>\n      <b>Detailed changes list:</b>\n      <ul>\n        <li>Copy from remote to local</li>\n        <li>Change lower case to upper case during DS mask creation</li>\n        <li>Implemented Control panel in Job Console log view to operate with job</li>\n        <li>Job Release operation runner</li>\n        <li>Job Hold operation runner</li>\n        <li>Job Cancel operation runner</li>\n        <li>Autosync rework</li>\n        <li>ScrollPanel in \"Allocate Dataset\" frame</li>\n        <li>Separate icons for Datasets and USS folders</li>\n        <li>Force rename option</li>\n        <li>Implemented ability to add Job Filter in 'New' popup menu clicking on JobWorkingSet</li>\n        <li>z/OSMF 2.5 support</li>\n        <li>log4j is removed</li>\n        <li>Username/Password validatiion during connection creation</li>\n      </ul>\n      <b>Bugs fixed:</b>\n      <ul>\n        <li>The creation of masks with three or more asterisks is not blocked</li>\n        <li>NPE when notification was closed</li>\n        <li>Error when the prefix length for JobFilter is more than 8 characters or Prefix contains unacceptable symbols</li>\n        <li>Wrong Directory allocation restrictions</li>\n        <li>Error 404 on try to create a dataset</li>\n        <li>Block size is being removed on error</li>\n        <li>Missing UI error message for z/OS mask with length more than 44 chars</li>\n        <li>Adding job filter through context menu item in JES Explorer doesn't work correctly</li>\n        <li>Creating z/OS mask with first digit in HLQ is not blocked</li>\n        <li>Right click-&gt;New-&gt;WorkingSet on JES Explorer page opens dialog to create WorkingSet instead of JobsWorkingSet</li>\n        <li>Creating mask with length=44 chars should be available</li>\n        <li>The error message contains java exception when uncheck \"Accept self-signed SSL certiаficates\" in the connection</li>\n        <li>Delete option does not work for Working Sets in File Explorer</li>\n        <li>Renaming an uss folder/file and then renaming it back to its original name causes an error</li>\n        <li>No message details when renaming dataset to existing name</li>\n        <li>Error message for failed dataset allocation should be duplicated in Dataset Allocation window</li>\n        <li>Impossible to close job's output</li>\n        <li>IDE Fatal errors if delete the connection that has working set</li>\n        <li>Use binary mode changes file contents</li>\n        <li>NullPointerException when tree opens by user with incorrect password</li>\n        <li>Impossible to close the file located locally on PC (the file was opened not from plugin)</li>\n        <li>Fixed file content corruption after chaging file mode</li>\n        <li>InfoOperation requires state instead of connection settings</li>\n        <li>\"Error\" message if connection is deleted</li>\n        <li>The job is marked as finished in job console if close tab for any another job</li>\n        <li>Hold/release only works for first selected jobid</li>\n        <li>Validation of directory blocks when creating dataset</li>\n        <li>File cache conflict message if create new member in PDS and open it right after creation</li>\n        <li>Validate jobId when creating job filter</li>\n        <li>CredentialsNotFoundForConnection exception in plugin</li>\n        <li>Creating Job Filters in configuration table with prefix/owner/job id length &gt;8 is not blocked</li>\n        <li>'Test passed' message in the jobs console</li>\n        <li>Allocate like does not save some parameters</li>\n        <li>GitHub issue #42</li>\n      </ul>","dependencies":["com.intellij.modules.platform"],"since":"203.5981","until":"221.*","sourceCodeUrl":"https://github.com/zowe/zowe-explorer-intellij","size":10549866}