{"id":183932,"xmlId":"allure-ee-idea","name":"Allure TestOps Support","description":"\n        \n        <h3>IntelliJ IDEA plug-in for Allure TestOps allows you</h3>\n\n        <p>To send test results from IntelliJ IDEA to Allure TesOps server</p>\n        <ul>\n            <li>\n                Test results from IntelliJ IDEA will be sent to Allure Server\n                and new Launch with test results will be created.\n            </li>\n        </ul>\n\n        <p>To assign AllureID for your tests in the code</p>\n        <ul>\n            <li>\n                Main identifier for a test is full qualified name.\n                If you modify any of the parts of the full path,\n                then a test case with old full path will become an orphan.\n            </li>\n            <li>\n                If you assign AllureID to your test cases in your code,\n                then any changed to the code will automatically\n                update test cases in Allure and there will be no orphans.\n            </li>\n        </ul>\n        <p>To create templates for your manual test cases automation</p>\n        <ul>\n            <li>\n                By using an empty method in your code you need to assign AllureID of a manual\n                test case from Allure TestOps test cases, then use **Allure Automate** command\n                and you will get a template for an automated test case with step-based logic in IntelliJ IDEA.\n            </li>\n            <li>\n                The steps of new test case will be the same as for the manual test case from Allure TestOps server.\n            </li>\n            <li>\n                You can either make a clone of the manual test case or fully\n            </li>\n        </ul>\n        \n    ","tags":["Testing"],"vendor":"Qameta Software","version":"3.17.0","optionalDependencies":["gherkin","org.jetbrains.kotlin","com.intellij.modules.java","org.intellij.groovy","com.intellij.modules.python","com.jetbrains.php","com.github.jnhyperion.hyperrobotframeworkplugin"],"since":"193.0","size":5911798}